# Module 3: Data Analytics with Python - Applied Statistics

## Lab 2: Data Manipulation with Pandas

The true power of the Pandas DataFrame is the ease and flexibility of manipulating data to get your desired results.

Pandas is best at handling tabular data sets comprising different variable types (integer, float, double, etc.).

In addition, the pandas library can also be used to perform even the most naive of tasks such as loading data or doing feature engineering on time series data.

<br><br><br><br><br><br>
## Objective
*** 

<ul type='disc'>
  <li>Importing and Exporting JSON files</li>
  <li> Selection of Columns and filtering DataFrame</li>
      <ul type='circle'>
      <li>Selecting</li>
      <li>Dropping</li>
    </ul>
  <li> Joining and Merging Pandas Data Frame </li>
      <ul type='circle'>
      <li>Joining</li>
      <li>Merging</li>
    </ul>
  <li>Descriptive Analysis with Python</li>
</ul>

<br><br><br><br>
## Importing and exporting JSON files
***

The full form of JSON is JavaScript Object Notation. It means that a script (executable) file which is made of text in a programming language, is used to store and transfer the data. Python supports JSON through a built-in package called json. 

The below code will write contents to the json file.

In [27]:
import json
  
# Data to be written
dictionary ={
    "name" : "Meghan",
    "rollno" : 56,
    "cgpa" : 8.6,
    "age": 23
}
  
# Serializing json 
json_object = json.dumps(dictionary, indent = 4)
  
# Writing to sample.json
with open("sample.json", "w") as outfile:
    outfile.write(json_object)

This will read contents from the json file and output it to the user.

In [28]:
import json
  
# Opening JSON file
with open('sample.json', 'r') as openfile:
  
    # Reading from json file
    json_object = json.load(openfile)
  
print(json_object)
print(type(json_object))

{'name': 'Meghan', 'rollno': 56, 'cgpa': 8.6, 'age': 23}
<class 'dict'>

<br><br><br><br><br><br>
## Selection of Columns and filtering DataFrame
***

### Selecting
The DataFrame object supports indexing operations just like the Python list class and the Pandas Series object, but is much faster and more powerful.

Note that when you extract a single row or column, you get a one-dimensional object as output. That is called a pandas Series. The values on the left are just labels taken from the dataframe index.

On the other hand, when we extract portions of a pandas dataframe, we get a two-dimensional DataFrame type of object. Something to keep in mind for later.

In [29]:
import pandas as pd
data = {'name': ['Indar', 'Angela', 'Tsy', 'Paio'],
        'reports': [3, 4, 2, 12],
        'age':[23, 22, 32, 24]
        }
df = pd.DataFrame(data)
col_name = df['name']
col_reports = df['reports']

Pandas provides a powerful way to work with both rows and columns together, optionally using their label indices or numeric indices.

* .loc :
    Purely label-location based indexer for selection by label (but may also be used with a boolean array).
    Important: If you use slicing in loc, it will return the end index as well

* .iloc:
    Purely integer-location based indexing for selection by position (but may also be used with a boolean array).

Allowed inputs are:
1. A single label, e.g. 5 or 'a'
2. A list or array of labels, e.g. ['a', 'b', 'c']
3. A slice object with labels, e.g. 'a':'f'

In [30]:
import pandas as pd
data = {'name': ['Indar', 'Angela', 'Tsy', 'Paio'],
        'reports': [3, 4, 2, 12],
        'age':[23, 22, 32, 24]
        }

df = pd.DataFrame(data)
print(df.loc[:,'age'])

0    23
1    22
2    32
3    24
Name: age, dtype: int64

In [31]:
print(df.iloc[:, 1])

0     3
1     4
2     2
3    12
Name: reports, dtype: int64

<br><br><br><br>
### Dropping
***
Return new object with labels in requested axis removed.

Note that Pandas uses zero based numbering, so 0 is the first row, 1 is the second row, etc. You can select ranges relative to the top or drop relative to the bottom of the DataFrame as well.

Note: Specifying both labels and index or columns will raise a **ValueError**.

In [32]:
#Dropping rows and columns in DataFrame
import pandas as pd
data = {'name': ['Indar', 'Angela', 'Tsy', 'Paio'],
        'reports': [3, 4, 2, 12],
        'age':[23, 22, 32, 24]
        }

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])

df.drop('a')

     name  reports  age
b  Angela        4   22
c     Tsy        2   32
d    Paio       12   24

Now, let us drop ‘age’ column. For this we use the axis=1 attribute in the drop () method.

In [33]:
data = {'name': ['Indar', 'Angela', 'Tsy', 'Paio'],
        'reports': [3, 4, 2, 12],
        'age':[23, 22, 32, 24],
        'city':['Medan', 'Jakarta', 'Badung', 'Jakarta']
        }

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])

#Here axis=1 denotes column
df.drop('age', axis=1)

     name  reports     city
a   Indar        3    Medan
b  Angela        4  Jakarta
c     Tsy        2   Badung
d    Paio       12  Jakarta

Drop a row using the index value. Here we drop 3rd row with index 'c'.

In [34]:
df.drop(df.index[2])

     name  reports  age     city
a   Indar        3   23    Medan
b  Angela        4   22  Jakarta
d    Paio       12   24  Jakarta

<br><br><br><br><br><br><br><br>
## Joining and Merging Pandas Data Frame
***

<br><br>
### Joining
***

In [35]:
import pandas as pd
raw_data = {
    'subject_id': ['1','2','3','4'],
    'first_name': ['Alex','Allan', 'Adit','Frezco'],
    'last_name':['Anderson', 'Ackerman', 'Aoni','Ali']
}

df_a = pd.DataFrame(raw_data)

raw_data = {
  'subject_id': ['4','5','6','7'],
    'first_name': ['Alexa','Amy', 'Aadira','Freya'],
    'last_name':['Lopez', 'Horan', 'Styles','Twain']
}

df_b = pd.DataFrame(raw_data)

#Joining two dataframes along rows

df_new = pd.concat([df_a, df_b])
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2      Allan  Ackerman
2          3       Adit      Aoni
3          4     Frezco       Ali
0          4      Alexa     Lopez
1          5        Amy     Horan
2          6     Aadira    Styles
3          7      Freya     Twain

In [36]:
#Joining two dataframes along columns
df_new = pd.concat([df_a,df_b], axis=1)
df_new

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Alexa     Lopez
1          2      Allan  Ackerman          5        Amy     Horan
2          3       Adit      Aoni          6     Aadira    Styles
3          4     Frezco       Ali          7      Freya     Twain

<br><br><br><br><br><br><br><br>
### Merging
***

Merging of data frame will merge two data frames having a unique column. Here we are merging df a which was defined earlier above with df_b and store the result in df_a.

In [37]:
df_a.merge(df_b)
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2      Allan  Ackerman
2          3       Adit      Aoni
3          4     Frezco       Ali

<br><br><br><br>
## Descriptive Analysis with Python
***

Descriptive Analysis is the type of analysis of data that helps describe, show or summarize data points in a constructive way such that patterns might emerge that fulfill every condition of the data. 

Let us consider a simple data frame consisting of name, age, pretest Score and post Test Score.

In [38]:
import pandas as pd
data = {'name': ['Indar', 'Angela', 'Tsy', 'Paio'],
        'age': [23, 31, 22, 20],
        'preTestScore':[35, 36, 33, 40],
        'postTestScore':[39, 37, 32, 38]
        }

df = pd.DataFrame(data, columns = ['name','age','preTestScore','postTestScore'])

We take a column named ‘preTestScore’ and find its statistics summary using describe () method.

In [39]:
df['preTestScore'].describe()     #Shows the statistics of preTestScore

count     4.00000
mean     36.00000
std       2.94392
min      33.00000
25%      34.50000
50%      35.50000
75%      37.00000
max      40.00000
Name: preTestScore, dtype: float64

Now we find the sum of the values in preTestScore.

In [40]:
df['age'].sum()           #Shows the total value of age column

96

We use the cumsum() method to find the cumulative sum of the pretes Score col.

In [41]:
df['preTestScore'].cumsum()   #Cumulative sum of preTestScore, moving from the rows

0     35
1     71
2    104
3    144
Name: preTestScore, dtype: int64

We use the count() method to find the number of non-NA values in the preTestScore col.

In [42]:
df['preTestScore'].count()     #Counts non-NA values

4

We use the min() method to find the minimum value in the preTestScore col.

In [43]:
df['preTestScore'].min()    #minimum of preTestScore

33

We use the max() method to find the maximum value in the preTestScore col.

In [44]:
df['preTestScore'].max()    #maximum of preTestScore

40

We use the median() method to find the median of the preTestScore col.

In [45]:
df['preTestScore'].median()

35.5

We use the var() method to find the variance of the preTestScore col.

In [46]:
df['preTestScore'].var()

8.666666666666666

We use the std() method to find the standard deviation of the preTestScore col.

In [47]:
df['preTestScore'].std()

2.943920288775949

We use the skew() method to find the skewness of the preTestScore col.

In [48]:
df['preTestScore'].skew()

0.9406609206739719

We use the kurt() method to find the kurtosis of the preTestScore col.

In [49]:
df['preTestScore'].kurt()

1.5